Catalogs/Renault_внНастройкиПодписокНаСобытия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_внНастройкиПодписокНаСобытия</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МетаданныеОбъектаСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Включено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_внТипТекстаПодписокНаСобытия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Пользователи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МетаданныеОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяТЧ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/Renault_внТипТекстаПодписокНаСобытия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_внТипТекстаПодписокНаСобытия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выражение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Текст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Формула</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Renault_внНастройкиПодписокНаСобытия/Forms/ФормаЭлементаУправляемая/Ext/Form/Module.bsl
&НаСервере
Процедура ОбновитьВидимостьИДоступность()
	
	Элементы.МетаданныеОбъектаСтрокой.Доступность	= Объект.Включено;
	Элементы.Включено.ЦветТекстаЗаголовка			= ?(Объект.Включено, WebЦвета.ТемноЗеленый, WebЦвета.ТемноСерый);
	Элементы.Формула.Доступность					= Объект.Включено;
	Элементы.Пользователи.Доступность				= Объект.Включено;
	Элементы.КП.Доступность							= Объект.Включено;
	
	Элементы.ОбычныйТекст.Пометка 					= Объект.ТипТекста = Перечисления.Renault_внТипТекстаПодписокНаСобытия.Текст;
	Элементы.ФормулаНаЯзыке1С.Пометка				= Объект.ТипТекста = Перечисления.Renault_внТипТекстаПодписокНаСобытия.Формула;
	Элементы.Выражение.Пометка						= Объект.ТипТекста = Перечисления.Renault_внТипТекстаПодписокНаСобытия.Выражение;	
	
	Если Объект.ТипТекста = Перечисления.Renault_внТипТекстаПодписокНаСобытия.Текст Тогда
		НадписьИнфо									= 
			"Введите статический текст, который будет показан пользователю.
			|Например: ""Реквизит документа изменен"" (без кавычек)";
	ИначеЕсли Объект.ТипТекста = Перечисления.Renault_внТипТекстаПодписокНаСобытия.Формула Тогда
		НадписьИнфо									= 
			"Введите формулу которая будет вычислена на встроенном языке 1С.
			|Например: ""Реквизит документа изменен пользователем "" + ПользовательКоторыйИзменил";
	Иначе
		НадписьИнфо									= 
			"Введите выражение которое будет выполнено на встроенном языке 1С. Должно быть возвращено две переменные ""Отказ"" (если Истина оповщения не будет), ""ТекстОповещения"" - результат оповещения";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Объект.ТипТекста = Перечисления.Renault_внТипТекстаПодписокНаСобытия.Текст;
		
	КонецЕсли;
	
	ОбновитьВидимостьИДоступность();

КонецПроцедуры

&НаКлиенте
Процедура ВключеноПриИзменении(Элемент)
	
	ОбновитьВидимостьИДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ФормулаНаЯзыке1С(Команда)
	
	Объект.ТипТекста = ПредопределенноеЗначение("Перечисление.Renault_внТипТекстаПодписокНаСобытия.Формула");
	ОбновитьВидимостьИДоступность();

КонецПроцедуры

&НаКлиенте
Процедура Выражение(Команда)

	Объект.ТипТекста = ПредопределенноеЗначение("Перечисление.Renault_внТипТекстаПодписокНаСобытия.Выражение");
	ОбновитьВидимостьИДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбычныйТекст(Команда)
	
	Объект.ТипТекста = ПредопределенноеЗначение("Перечисление.Renault_внТипТекстаПодписокНаСобытия.Текст");
	ОбновитьВидимостьИДоступность();

КонецПроцедуры

&НаКлиенте
Процедура МетаданныеОбъектаСтрокойОчистка(Элемент, СтандартнаяОбработка)
	
	Объект.МетаданныеОбъектаСтрокой = "";
	Объект.Пользователи.Очистить();
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПользователиПользовательНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	Элемент.СписокВыбора.Очистить();
	СЗ = Renault_внОбщийМодуль.СписокПользователей();
	Для Каждого Эл Из СЗ Цикл
		Элемент.СписокВыбора.Добавить(Эл.Значение, Эл.Представление);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура МетаданныеОбъектаСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Форма = ПолучитьФорму("Справочник.Renault_внНастройкиПодписокНаСобытия.Форма.ФормаВыбораМетаданныхУправляемая", ,ЭтаФорма);
	
	Форма.ВыбранныеОбъекты.Очистить();
	
	Для каждого Строки Из Объект.Объекты Цикл
		ЗаполнитьЗначенияСвойств(Форма.ВыбранныеОбъекты.Добавить(), Строки);
	КонецЦикла;
	
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
		
	Объект.МетаданныеОбъектаСтрокой = "";
	Объект.Объекты.Очистить();
	Для каждого Строки Из ВыбранноеЗначение Цикл
		
		Объект.МетаданныеОбъектаСтрокой = Объект.МетаданныеОбъектаСтрокой + Строки.МетаданныеОбъекта;
		Если НЕ ПустаяСтрока(Строки.ИмяТЧ) Тогда
			Объект.МетаданныеОбъектаСтрокой = Объект.МетаданныеОбъектаСтрокой + "." + Строки.ИмяТЧ;
		КонецЕсли;
		Если НЕ ПустаяСтрока(Строки.ИмяРеквизита) Тогда
			Объект.МетаданныеОбъектаСтрокой = Объект.МетаданныеОбъектаСтрокой + "." + Строки.ИмяРеквизита;
		КонецЕсли;
		Объект.МетаданныеОбъектаСтрокой = Объект.МетаданныеОбъектаСтрокой + "; ";
		ЗаполнитьЗначенияСвойств(Объект.Объекты.Добавить(), Строки);
			
	КонецЦикла;
	
	Объект.Объекты.Сортировать("МетаданныеОбъекта,ИмяТЧ,ИмяРеквизита");	
	
КонецПроцедуры
